In [12]:
# Practise exercises with Pandas dataframes

In [13]:
import pandas as pd

In [20]:
# Method 1: Specify full apth to file
stats = pd.read_csv('D:\\Code\\PythonAZ\\P4-Demographic-Data.csv')

In [15]:
# Method 2: Change working directory
import os

In [16]:
print(os.getcwd())

d:\Code\PythonAZ

In [17]:
# Change working directory
os.chdir('D:\Code\PythonAZ')

In [23]:
stats2=pd.read_csv('P4-Demographic-Data.csv')

In [ ]:
# Data Exploration

In [26]:
stats

,Country Name,Country Code,Birth rate,Internet users,Income Group
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income
...,...,...,...,...,...
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
191,South Africa,ZAF,20.850,46.5,Upper middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [30]:
# Nr of rows
len(stats) #195 rows imported (important to check to know how many rows there needs to be)

195

In [31]:
# See columns
stats.columns

Index(['Country Name', 'Country Code', 'Birth rate', 'Internet users',
       'Income Group'],
      dtype='object')

In [33]:
# Nr of columns
len(stats.columns)

5

In [38]:
# Top rows
stats.head(3) # top 3 rows

  Country Name Country Code  Birth rate  Internet users         Income Group
0        Aruba          ABW      10.244            78.9          High income
1  Afghanistan          AFG      35.253             5.9           Low income
2       Angola          AGO      45.985            19.1  Upper middle income

In [39]:
# Bottom rows
stats.tail(3)

,Country Name,Country Code,Birth rate,Internet users,Income Group
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
194,Zimbabwe,ZWE,35.715,18.5,Low income

In [40]:
# Info on the columns
stats.info() # what type, how many rows

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 195 entries, 0 to 194
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Country Name    195 non-null    object
 1   Country Code    195 non-null    object
 2   Birth rate      195 non-null    float64
 3   Internet users  195 non-null    float64
 4   Income Group    195 non-null    object
dtypes: float64(2), object(3)
memory usage: 5.4+ KB

In [41]:
# Get stats on the columns
stats.describe() #Like summary() in R

       Birth rate  Internet users
count  195.000000      195.000000
mean    21.469928       42.076471
std     10.605467       29.030788
min      7.900000        0.900000
25%     12.120500       14.520000
50%     19.680000       41.000000
75%     29.759500       66.225000
max     49.661000       96.546800

In [44]:
# Descriptive stats of the columns as 2 rows
stats.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Birth rate,195.0,21.469928,10.605467,7.9,12.1205,19.68,29.7595,49.6610
Internet users,195.0,42.076471,29.030788,0.9,14.5200,41.00,66.2250,96.5468

In [60]:
# Renaming columns
stats.columns=['a', 'b', 'c', 'd', 'e']
stats.head(1)

       a    b       c     d            e
0  Aruba  ABW  10.244  78.9  High income

In [95]:
stats.columns=['CountryName','CountryCode', 'Birthrate', 'Internetusers', 'IncomeGroup']
stats.head(1)

  CountryName CountryCode  Birthrate  Internetusers  IncomeGroup
0       Aruba         ABW     10.244           78.9  High income

In [66]:
# Subsetting dataframes
# - by rows
stats[2:4] #gives us rows by default bc this is far more common

  Country Name Country Code  Birth rate  Internet users         Income Group
2       Angola          AGO      45.985            19.1  Upper middle income
3      Albania          ALB      12.877            57.2  Upper middle income

In [77]:
# Reverse the dataframe
stats[::-1] #Does not modify the dataframe

,Country Name,Country Code,Birth rate,Internet users,Income Group
194,Zimbabwe,ZWE,35.715,18.5,Low income
193,Zambia,ZMB,40.471,15.4,Lower middle income
192,"Congo, Dem. Rep.",COD,42.394,2.2,Low income
191,South Africa,ZAF,20.850,46.5,Upper middle income
190,"Yemen, Rep.",YEM,32.947,20.0,Lower middle income
...,...,...,...,...,...
4,United Arab Emirates,ARE,11.044,88.0,High income
3,Albania,ALB,12.877,57.2,Upper middle income
2,Angola,AGO,45.985,19.1,Upper middle income
1,Afghanistan,AFG,35.253,5.9,Low income
0,Aruba,ABW,10.244,78.9,High income

In [79]:
#Get only every 20th row
stats[::20]

    Country Name Country Code  Birth rate  Internet users         Income Group
0          Aruba          ABW      10.244         78.9000          High income
20       Belarus          BLR      12.500         54.1700  Upper middle income
40    Costa Rica          CRI      15.022         45.9600  Upper middle income
60         Gabon          GAB      30.555          9.2000  Upper middle income
80         India          IND      20.291         15.1000  Lower middle income
100        Libya          LBY      21.425         16.5000  Upper middle income
120   Mozambique          MOZ      39.705          5.4000           Low income
140       Poland          POL       9.600         62.8492          High income
160     Suriname          SUR      18.455         37.4000  Upper middle income
180      Uruguay          URY      14.374         57.6900          High income

In [92]:
# Sebsetting by columns
stats['CountryCode'].head(3)

0    ABW
1    AFG
2    AGO
Name: Country Code, dtype: object

In [93]:
stats[['CountryName', 'IncomeGroup']].head() #to get more than 1 column, input must be a list
# list order is arbitrary

           Country Name         Income Group
0                 Aruba          High income
1           Afghanistan           Low income
2                Angola  Upper middle income
3               Albania  Upper middle income
4  United Arab Emirates          High income

In [100]:
#Alternative way to access one column. Can't have any spaces in the col names
stats.Birthrate.head()

0    10.244
1    35.253
2    45.985
3    12.877
4    11.044
Name: Birthrate, dtype: float64

In [105]:
# Combined subsetting of rows and columns
# One subset on top of another
stats[4:8][['CountryName', 'IncomeGroup']]

            CountryName          IncomeGroup
4  United Arab Emirates          High income
5             Argentina          High income
6               Armenia  Lower middle income
7   Antigua and Barbuda          High income

In [106]:
#Order of specifying rows/columns does not matter
stats[['CountryName', 'IncomeGroup']][4:8]

            CountryName          IncomeGroup
4  United Arab Emirates          High income
5             Argentina          High income
6               Armenia  Lower middle income
7   Antigua and Barbuda          High income

In [109]:
# Mathematical operations with dataframes
result = stats.Birthrate*stats.Internetusers
result.head()

0    808.2516
1    207.9927
2    878.3135
3    736.5644
4    971.8720
dtype: float64

In [116]:
# Add a column
stats['MyCalc'] = stats.Birthrate*stats.Internetusers
stats.head()

,CountryName,CountryCode,Birthrate,Internetusers,IncomeGroup,MyCalc
0,Aruba,ABW,10.244,78.9,High income,808.2516
1,Afghanistan,AFG,35.253,5.9,Low income,207.9927
2,Angola,AGO,45.985,19.1,Upper middle income,878.3135
3,Albania,ALB,12.877,57.2,Upper middle income,736.5644
4,United Arab Emirates,ARE,11.044,88.0,High income,971.8720

In [117]:
# Removing a column
stats.drop('MyCalc', axis=1) 
# By default it drops rows. Need to specify axis=1 or 1 to drop a column
# Returns a new object. Does not modify the existing one
stats = stats.drop('MyCalc', axis=1) 
stats.head(3)

   CountryName CountryCode  Birthrate  Internetusers          IncomeGroup
0        Aruba         ABW     10.244           78.9          High income
1  Afghanistan         AFG     35.253            5.9           Low income
2       Angola         AGO     45.985           19.1  Upper middle income

In [ ]:
# Filtering dataframes
# Filtering is about rows. We're finding a subset of data that fits some criteria

In [122]:
stats.Internetusers<2

0      False
1      False
2      False
3      False
4      False
       ...
190    False
191    False
192    False
193    False
194    False
Name: Internetusers, Length: 195, dtype: bool

In [123]:
stats[stats.Internetusers<2].head()

    CountryName CountryCode  Birthrate  Internetusers          IncomeGroup
11      Burundi         BDI     44.151            1.3           Low income
52      Eritrea         ERI     34.800            0.9           Low income
55     Ethiopia         ETH     32.925            1.9           Low income
64       Guinea         GIN     37.337            1.6           Low income
117     Myanmar         MMR     18.119            1.6  Lower middle income

In [136]:
# Creating True/False lists for use as filters
Filter1=stats.Internetusers<2
Filter2=stats.Birthrate>40

In [133]:
stats[stats.Birthrate > 40 and stats.Internetusers < 2] #Error, why?

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [134]:
stats.Birthrate > 40 and stats.Internetusers < 2 #Also error, why?
# Because Python is not a vectorized programming language
# the "and" is waiting for a second true or false condition for a single value
# the "and" operator here does not know how to work with list, vectors (unlike R)
# as Python puts it "The truth value of a Series in ambiguous"

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [138]:
# Correct way to filter multiple conditions is with &
stats[Filter1 & Filter2]

    CountryName CountryCode  Birthrate  Internetusers IncomeGroup
11      Burundi         BDI     44.151            1.3  Low income
127       Niger         NER     49.661            1.7  Low income
156     Somalia         SOM     43.891            1.5  Low income

In [140]:
# To use multiple conditions straigh-up, need to use () to specify order of operations.
stats[(stats.Birthrate>40) & (stats.Internetusers<2)]

    CountryName CountryCode  Birthrate  Internetusers IncomeGroup
11      Burundi         BDI     44.151            1.3  Low income
127       Niger         NER     49.661            1.7  Low income
156     Somalia         SOM     43.891            1.5  Low income

In [142]:
# Filtering by categorical value
stats[stats.IncomeGroup=='High income']

               CountryName CountryCode  Birthrate  Internetusers  IncomeGroup
0                    Aruba         ABW     10.244          78.90  High income
4     United Arab Emirates         ARE     11.044          88.00  High income
5                Argentina         ARG     17.716          59.90  High income
7      Antigua and Barbuda         ATG     16.447          63.40  High income
8                Australia         AUS     13.200          83.00  High income
..                     ...         ...        ...            ...          ...
174    Trinidad and Tobago         TTO     14.590          63.80  High income
180                Uruguay         URY     14.374          57.69  High income
181          United States         USA     12.500          84.20  High income
184          Venezuela, RB         VEN     19.842          54.90  High income
185  Virgin Islands (U.S.)         VIR     10.700          45.30  High income

[67 rows x 5 columns]

In [143]:
# How to get unique categories inside a column
stats.IncomeGroup.unique()

array(['High income', 'Low income', 'Upper middle income',
       'Lower middle income'], dtype=object)

In [147]:
# Quick exercise: Find out everything about Malta
stats[stats.CountryName=='Malta']

    CountryName CountryCode  Birthrate  Internetusers  IncomeGroup
116       Malta         MLT        9.5        68.9138  High income

In [151]:
# Accessing individual elements
# .at # for labels at.... Even integers are treated as labels.
# .iat # counts integers to the specified location

In [153]:
# Finding value using the location coordinate
stats.iat[3,4]

'Upper middle income'

In [154]:
# Finding value using column names
stats.at[2,'Birthrate']

45.985

In [162]:
# Why we need .at
sub10=stats[::10]
sub10.head()

   CountryName CountryCode  Birthrate  Internetusers          IncomeGroup
0        Aruba         ABW     10.244          78.90          High income
10  Azerbaijan         AZE     18.300          58.70  Upper middle income
20     Belarus         BLR     12.500          54.17  Upper middle income
30      Canada         CAN     10.900          85.80          High income
40  Costa Rica         CRI     15.022          45.96  Upper middle income

In [163]:
sub10.iat[10,0] # gives 'Libya'

'Libya'

In [164]:
sub10.at[10,'CountryName'] # Gives 'Azerbaijan'

'Azerbaijan'